In [57]:
import pandas as pd

In [113]:
data = {
  'co2': [95, 90, 99, 104, 105, 94, 99, 104],
  'model': ['Citigo', 'Fabia', 'Fiesta', 'Rapid', 'Focus', 'Mondeo', 'Octavia', 'B-Max'],
  'car': ['Skoda', 'Skoda', 'Ford', 'Skoda', 'Ford', 'Ford', 'Skoda', 'Ford'],
  'price' : [55000, 48000, 38000, 42000, 61000, 65000, 70000, 51000]
}

In [115]:
df = pd.DataFrame(data)
df
#df.groupby(["car"]).mean()

   co2    model    car  price
0   95   Citigo  Skoda  55000
1   90    Fabia  Skoda  48000
2   99   Fiesta   Ford  38000
3  104    Rapid  Skoda  42000
4  105    Focus   Ford  61000
5   94   Mondeo   Ford  65000
6   99  Octavia  Skoda  70000
7  104    B-Max   Ford  51000

In [117]:
dfg = df.groupby(["car"])

In [119]:
dfg.ngroups

2

In [121]:
dfg.size()

car
Ford     4
Skoda    4
dtype: int64

In [123]:
dfg.nth(2)

   co2   model    car  price
3  104   Rapid  Skoda  42000
5   94  Mondeo   Ford  65000

In [125]:
dfg.get_group('Ford')

/var/folders/2v/kgb9p_hn6ss9mqhg1hbvvgxh0000gn/T/ipykernel_4900/3179603583.py:1: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  dfg.get_group('Ford')

   co2   model   car  price
2   99  Fiesta  Ford  38000
4  105   Focus  Ford  61000
5   94  Mondeo  Ford  65000
7  104   B-Max  Ford  51000

In [127]:
df[df["car"]=="Ford"]

   co2   model   car  price
2   99  Fiesta  Ford  38000
4  105   Focus  Ford  61000
5   94  Mondeo  Ford  65000
7  104   B-Max  Ford  51000

In [129]:
for name_of_group, contents_of_group in dfg:
    print(name_of_group)
    print(contents_of_group)

('Ford',)
   co2   model   car  price
2   99  Fiesta  Ford  38000
4  105   Focus  Ford  61000
5   94  Mondeo  Ford  65000
7  104   B-Max  Ford  51000
('Skoda',)
   co2    model    car  price
0   95   Citigo  Skoda  55000
1   90    Fabia  Skoda  48000
3  104    Rapid  Skoda  42000
6   99  Octavia  Skoda  70000

In [135]:
gb_cols = dfg[["co2","price"]]
gb_cols.mean()

         co2    price
car
Ford   100.5  53750.0
Skoda   97.0  53750.0

In [145]:
gb_cols.aggregate(['min', 'max', 'sum', 'mean'])

      co2                   price
      min  max  sum   mean    min    max     sum     mean
car
Ford   94  105  402  100.5  38000  65000  215000  53750.0
Skoda  90  104  388   97.0  42000  70000  215000  53750.0

In [147]:
dict = {'co2':'sum', "price":'max'}

In [149]:
gb_cols.aggregate(dict)

       co2  price
car
Ford   402  65000
Skoda  388  70000

In [151]:
gb_cols.describe()

        co2                                                     price  \
      count   mean       std   min    25%    50%     75%    max count
car
Ford    4.0  100.5  5.066228  94.0  97.75  101.5  104.25  105.0   4.0
Skoda   4.0   97.0  5.944185  90.0  93.75   97.0  100.25  104.0   4.0


          mean           std      min      25%      50%      75%      max
car
Ford   53750.0  12038.133853  38000.0  47750.0  56000.0  62000.0  65000.0
Skoda  53750.0  12065.791865  42000.0  46500.0  51500.0  58750.0  70000.0